# Introduction to Pandas

In [13]:
import pandas as pd

### Reading File from disk

In [4]:
df = pd.read_csv('parks.csv', index_col=['Park Code'])

In [6]:
df.head(3)

                        Park Name State   Acres  Latitude  Longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50

## Indexing

### Index single row with iloc (using row number)

In [16]:
df.iloc[1] # at position 1

Park Name    Arches National Park
State                          UT
Acres                       76519
Latitude                    38.68
Longitude                 -109.57
Name: ARCH, dtype: object

### Index single row with loc (using data frame index)

In [15]:
df.loc['ACAD'] # with index = 'ACAD'

Park Name    Acadia National Park
State                          ME
Acres                       47390
Latitude                    44.35
Longitude                  -68.21
Name: ACAD, dtype: object

### Index multiple rows with iloc (using row number)

In [21]:
df.iloc[[2, 1, 0]]

                        Park Name State   Acres  Latitude  Longitude
Park Code
BADL       Badlands National Park    SD  242756     43.75    -102.50
ARCH         Arches National Park    UT   76519     38.68    -109.57
ACAD         Acadia National Park    ME   47390     44.35     -68.21

### Index multiple rows with loc (using data frame index)

In [22]:
df.loc[['BADL', 'ARCH', 'ACAD']]

                        Park Name State   Acres  Latitude  Longitude
Park Code
BADL       Badlands National Park    SD  242756     43.75    -102.50
ARCH         Arches National Park    UT   76519     38.68    -109.57
ACAD         Acadia National Park    ME   47390     44.35     -68.21

In [28]:
df[:2] # indexing first 2 rows
df[2:] # indexing all rows starting from index 1
df[3:6] # indexing from row 3 to 5

,Park Name,State,Acres,Latitude,Longitude
Park Code,,,,,
BIBE,Big Bend National Park,TX,801163,29.25,-103.25
BISC,Biscayne National Park,FL,172924,25.65,-80.08
BLCA,Black Canyon of the Gunnison National Park,CO,32950,38.57,-107.72

### Indexing coloumns

In [33]:
df['State'].head(5)
df.State.head(5)

Park Code
ACAD    ME
ARCH    UT
BADL    SD
BIBE    TX
BISC    FL
Name: State, dtype: object

In [34]:
df.columns

Index(['Park Name', 'State', 'Acres', 'Latitude', 'Longitude'], dtype='object')

In [36]:
df.columns = [ col.replace(' ','_').lower() for col in df.columns]

In [37]:
df.columns

Index(['park_name', 'state', 'acres', 'latitude', 'longitude'], dtype='object')

### Indexing Columns and Rows

In [39]:
df[['state','acres']][:3]

          state   acres
Park Code
ACAD         ME   47390
ARCH         UT   76519
BADL         SD  242756

### Seleceting subset of data

In [42]:
(df.state == 'UT').head(3)

Park Code
ACAD    False
ARCH     True
BADL    False
Name: state, dtype: bool

In [45]:
df[df.state == 'UT']

                            park_name state   acres  latitude  longitude
Park Code
ARCH             Arches National Park    UT   76519     38.68    -109.57
BRCA       Bryce Canyon National Park    UT   35835     37.57    -112.18
CANY        Canyonlands National Park    UT  337598     38.20    -109.93
CARE       Capitol Reef National Park    UT  241904     38.20    -111.17
ZION               Zion National Park    UT  146598     37.30    -113.05

#### ~ replaces not

#### | replaces or

#### & replaces and

In [46]:
df[(df.latitude > 60) | (df.acres > 10**6)].head(3)

,park_name,state,acres,latitude,longitude
Park Code,,,,,
DENA,Denali National Park and Preserve,AK,3372402,63.33,-150.50
DEVA,Death Valley National Park,"CA, NV",4740912,36.24,-116.82
EVER,Everglades National Park,FL,1508538,25.32,-80.93

### Key Companion Methods: isin

In [48]:
df[df.state.isin(['WA', 'OR', 'CA'])].head()

                               park_name state   acres  latitude  longitude
Park Code
CHIS       Channel Islands National Park    CA  249561     34.01    -119.42
CRLA           Crater Lake National Park    OR  183224     42.94    -122.10
JOTR           Joshua Tree National Park    CA  789745     33.79    -115.90
LAVO       Lassen Volcanic National Park    CA  106372     40.49    -121.51
MORA         Mount Rainier National Park    WA  235625     46.85    -121.75

### Describe command

In [49]:
df.describe()

              acres   latitude   longitude
count  5.600000e+01  56.000000   56.000000
mean   9.279291e+05  41.233929 -113.234821
std    1.709258e+06  10.908831   22.440287
min    5.550000e+03  19.380000 -159.280000
25%    6.901050e+04  35.527500 -121.570000
50%    2.387645e+05  38.550000 -110.985000
75%    8.173602e+05  46.880000 -103.400000
max    8.323148e+06  67.780000  -68.210000